In [113]:
import pandas as pd
from file_utils import save_to_pickle

## Listings
list of available rooms (listing)
- id_listing_anon: primary key
- room_type: categorical, no missing values
- listing_neighborhood: categorical, no missing values ("-unknown-" represents missing info)

In [114]:
df_listings = pd.read_csv('./listings.csv')
df_listings.head(4)

,id_listing_anon,room_type,listing_neighborhood,total_reviews
0,71582793-e5f8-46d7-afdf-7a31d2341c79,Private room,-unknown-,0.0
1,a1a3f728-e21f-4432-96aa-361d28e2b319,Entire home/apt,Copacabana,0.0
2,353a68be-ecf9-4b7b-9533-c882dc2f0760,Entire home/apt,Barra da Tijuca,3.0
3,b9ae1908-0486-40ac-bbcf-bd63ffebfe63,Entire home/apt,Lapa,4.0

In [115]:
df_listings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13038 entries, 0 to 13037
Data columns (total 4 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id_listing_anon       13038 non-null  object
 1   room_type             13038 non-null  object
 2   listing_neighborhood  13038 non-null  object
 3   total_reviews         13038 non-null  float64
dtypes: float64(1), object(3)
memory usage: 407.6+ KB

In [116]:
df_listings.describe(include='object')

,id_listing_anon,room_type,listing_neighborhood
count,13038,13038,13038
unique,13038,3,68
top,71582793-e5f8-46d7-afdf-7a31d2341c79,Entire home/apt,-unknown-
freq,1,9647,6221

In [117]:
df_listings.describe()

       total_reviews
count   13038.000000
mean        7.004525
std        17.059747
min       -34.000000
25%         0.000000
50%         1.000000
75%         5.000000
max       268.000000

### Imputting negative review counts

In [118]:
negative_reviews_count = len(df_listings[df_listings['total_reviews'] < 0])
df_listings.loc[df_listings['total_reviews'] < 0, 'total_reviews'] = 0
print('Rows imputted: ', negative_reviews_count)

Rows imputted:  41

## Contacts
- foreign keys: id_guest_anon, id_host_anon, id_listing_anon
- ts_reply_at_first, ts_accepted_at_first, ts_booking_at: may or not be present (NaN)
- m_guests: has missing values

In [119]:
df_contacts = pd.read_csv('./contacts.csv')
df_contacts.head(4)

,id_guest_anon,id_host_anon,id_listing_anon,ts_interaction_first,ts_reply_at_first,ts_accepted_at_first,ts_booking_at,ds_checkin_first,ds_checkout_first,m_guests,m_interactions,m_first_message_length_in_characters,contact_channel_first,guest_user_stage_first
0,da8656a1-51af-4f38-b1c4-94be1f585157,5426897d-960d-4013-9e38-606ae746793c,a408a8b2-0d44-4513-a611-3736d0409bb2,2016-04-21 02:55:53,2016-04-21 03:15:00.0,2016-04-21 03:15:00.0,2016-04-21 03:15:00.0,2016-08-02,2016-08-06,4.0,30,31.0,book_it,past_booker
1,8590d6f1-8bc9-4e8b-bdfb-de78f69fcf37,f30417c5-6df4-45ac-bfc2-6ad1cce398ab,e387c705-0aeb-464c-9375-ece63be6f006,2016-02-16 22:14:01,2016-02-16 23:37:36.0,NaN,NaN,2016-08-11,2016-08-22,5.0,2,312.0,contact_me,past_booker
2,ebcd83ba-bda1-47eb-9680-2dd04ccf3988,13cbf50a-3272-45d4-9866-a06b6ea1b99a,d1eb1960-938f-4305-a353-51e224414dd4,2016-01-27 23:33:38,2016-01-28 02:12:47.0,NaN,NaN,2016-03-14,2016-03-23,1.0,3,164.0,contact_me,new
3,b0af8848-fe2a-4ef1-991e-26ab3066feb3,01614601-d5a4-4776-ab9b-c10d3b865bf0,855f6779-346c-45fc-a64b-ea133250ca7a,2016-05-05 14:42:52,2016-05-05 15:17:40.0,2016-05-05 15:17:40.0,NaN,2016-05-27,2016-05-29,2.0,3,203.0,contact_me,new

In [120]:
df_contacts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27887 entries, 0 to 27886
Data columns (total 14 columns):
 #   Column                                Non-Null Count  Dtype
---  ------                                --------------  -----
 0   id_guest_anon                         27887 non-null  object
 1   id_host_anon                          27887 non-null  object
 2   id_listing_anon                       27887 non-null  object
 3   ts_interaction_first                  27887 non-null  object
 4   ts_reply_at_first                     25855 non-null  object
 5   ts_accepted_at_first                  16415 non-null  object
 6   ts_booking_at                         11587 non-null  object
 7   ds_checkin_first                      27887 non-null  object
 8   ds_checkout_first                     27887 non-null  object
 9   m_guests                              27886 non-null  float64
 10  m_interactions                        27887 non-null  int64
 11  m_first_message_length_in_characters  27887 non-null  float64
 12  contact_channel_first                 27887 non-null  object
 13  guest_user_stage_first                27887 non-null  object
dtypes: float64(2), int64(1), object(11)
memory usage: 3.0+ MB

In [121]:
date_columns = ['ts_interaction_first','ts_reply_at_first','ts_accepted_at_first','ts_booking_at','ds_checkin_first','ds_checkout_first']
for colum_name in date_columns:
    df_contacts[colum_name] = df_contacts[colum_name].apply(pd.Timestamp)

In [122]:
df_contacts.isnull().sum()

id_guest_anon                               0
id_host_anon                                0
id_listing_anon                             0
ts_interaction_first                        0
ts_reply_at_first                        2032
ts_accepted_at_first                    11472
ts_booking_at                           16300
ds_checkin_first                            0
ds_checkout_first                           0
m_guests                                    1
m_interactions                              0
m_first_message_length_in_characters        0
contact_channel_first                       0
guest_user_stage_first                      0
dtype: int64

In [123]:
contacts_with_guests = df_contacts[df_contacts['m_guests'].isna() == False]
print('Rows with no guests removed: ', len(df_contacts) - len(contacts_with_guests))
df_contacts = contacts_with_guests

Rows with no guests removed:  1

In [124]:
df_contacts.describe()

,ts_interaction_first,ts_reply_at_first,ts_accepted_at_first,ts_booking_at,ds_checkin_first,ds_checkout_first,m_guests,m_interactions,m_first_message_length_in_characters
count,27886,25854,16415,11587,27886,27886,27886.000000,27886.000000,27886.000000
mean,2016-03-23 07:27:56.842752768,2016-03-25 03:09:02.702560512,2016-03-30 16:20:44.481267200,2016-04-02 17:27:40.525761536,2016-05-31 20:03:35.850247424,2016-06-08 08:43:52.546797568,2.782041,8.256007,193.714767
min,2016-01-01 00:46:47,2016-01-01 01:07:50,2016-01-01 12:24:15,2016-01-01 12:24:15,2016-01-01 00:00:00,2016-01-02 00:00:00,0.000000,1.000000,0.000000
25%,2016-01-28 00:12:19.500000,2016-01-29 19:51:35,2016-02-08 19:14:27,2016-02-14 12:37:13.500000,2016-03-11 00:00:00,2016-03-18 00:00:00,2.000000,3.000000,66.000000
50%,2016-03-18 23:18:20,2016-03-21 20:55:28,2016-03-30 12:16:14,2016-04-03 17:18:48,2016-06-11 00:00:00,2016-06-20 00:00:00,2.000000,5.000000,154.000000
75%,2016-05-13 05:49:36,2016-05-15 13:53:32.249999872,2016-05-19 12:44:38,2016-05-21 16:41:14,2016-08-08 00:00:00,2016-08-16 00:00:00,4.000000,10.000000,269.000000
max,2016-06-30 23:58:14,2017-02-23 08:56:59,2016-11-22 11:11:12,2016-09-21 21:55:48,2018-05-01 00:00:00,2018-05-04 00:00:00,16.000000,410.000000,2341.000000
std,NaN,NaN,NaN,NaN,NaN,NaN,1.863797,10.035914,183.175068

In [125]:
df_contacts['contact_channel_first'].value_counts()

contact_channel_first
contact_me      12827
book_it          8366
instant_book     6693
Name: count, dtype: int64

In [126]:
df_contacts['guest_user_stage_first'].value_counts()

guest_user_stage_first
new            15905
past_booker    11946
-unknown-         35
Name: count, dtype: int64

## Users
- id_user_anon: primary key
- country:

In [127]:
df_users = pd.read_csv('./users.csv')
df_users.head(4)

                           id_user_anon country  words_in_user_profile
0  1d16a001-31a2-494c-a101-1f7b308adc62      FR                      0
1  42607e0a-86c0-472e-b633-9e192114e93c      AR                      0
2  25f85eb5-a700-44e1-b142-4c076222198d      BR                      0
3  55abeba0-18ef-4c58-80f4-3c278b706aca      BR                      1

In [128]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31525 entries, 0 to 31524
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id_user_anon           31525 non-null  object
 1   country                31524 non-null  object
 2   words_in_user_profile  31525 non-null  int64
dtypes: int64(1), object(2)
memory usage: 739.0+ KB

In [129]:
df_users.isnull().sum()

id_user_anon             0
country                  1
words_in_user_profile    0
dtype: int64

### Imputting missing country

In [130]:
most_common_country = df_users['country'].mode()[0]
users_with_missing_country = len(df_users[df_users['country'].isnull()])
df_users.loc[df_users['country'].isnull(), 'country'] = most_common_country
print('Rows imputted: ', users_with_missing_country)

Rows imputted:  1

In [131]:
df_users.describe()

       words_in_user_profile
count           31525.000000
mean               16.222141
std                44.391491
min                 0.000000
25%                 0.000000
50%                 0.000000
75%                12.000000
max              1460.000000

# Save cleaned data frames

In [132]:
save_to_pickle('./data/df_listings.pkl', df_listings)
save_to_pickle('./data/df_contacts.pkl', df_contacts)
save_to_pickle('./data/users.pkl', df_users)